app/controllers/entries_controller.rb

  def index
    respond_with Entry.all
---
SELECT "entries".* FROM "entries"

  def create
    respond_with Entry.create(entry_params)
---
INSERT INTO "entries" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "khushi"], ["created_at", "2015-04-09 20:36:34.915858"], ["updated_at", "2015-04-09 20:36:34.915858"]]

  def update
    respond_with Entry.update(params[:id], entry_params)
---
UPDATE "entries" SET "winner" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["winner", "t"], ["updated_at", "2015-04-09 20:36:38.382966"], ["id", 6]]